{
  "basics": {
    "name": "Garrick Aden-Buie",
    "label": "Data Scientist",
    "website": "https://www.garrickadenbuie.com",
    "phone": "(727) 344-9568",
    "email": "garrick@adenbuie.com",
    "location": {
      "address": "474 34th Ave N.",
      "postalCode": "FL 33704",
      "city": "St. Petersburg",
      "countryCode": "US",
      "region": "Florida"
    },
    "other": [],
    "summary": "Motivated, life-long learner. Always looking for questions and answers in the data. Passionate about collaboration, sharing knowledge, and communicating insights. Known as a highly organized, perceptive, and resourceful team player.",
    "picture": "",
    "profiles": [
      {
        "network": "GitHub",
        "username": "gadenbuie",
        "url": "https://github.com/gadenbuie"
      },
      {
        "network": "Twitter",
        "username": "grrrck",
        "url": "https://twitter.com/grrrck"
      }
    ]
  },
  "work": [
    {
      "company": "Collaborative Data Services, Moffitt Cancer Center",
      "position": "Scientific Programmer",
      "startDate": "2019-08-12",
      "endDate": "",
      "summary": "Worked closely with CDS analysts and Moffitt investigators as a software engineer to design and implement approachable and consistent tools to automate data access, cleaning, and reporting. Provided training and support to CDS analysts in data science best practices while architecting and implementing new workflows.",
      "highlights": [
        "Designed and led trainings in R programming, data analysis, and version control for multiple teams at Moffitt",
        "Developed **moffittverse**: a set of R packages to streamline project management, reporting, and access to hospital data systems",
        "Organized and led a weekly educational session for dozens of Moffitt R users centered around _R for Data Science_"
      ]
    },
    {
      "company": "rstudio::conf(2020)",
      "position": "Workshop: JavaScript for Shiny Users",
      "startDate": "2020-01-26",
      "endDate": "2020-01-28",
      "summary": "Created and led an entirely new, two-day, hands-on and project-driven workshop for 90 Shiny users on JavaScript and web development at one of the largest conferences for R users. Developed the js4shiny R package to support the workshop and provide additional resources and tools based on R Markdown and Shiny for JavaScript development in R and RStudio, including an R Markdown format for literate JavaScript programming and a Shiny app code editor and live preview for HTML, CSS and JS."
    },
    {
      "company": "Gerke Lab, Cancer Epidemiology, Moffitt Cancer Center",
      "position": "Research Data Analyst II (Bioinformatics)",
      "startDate": "2018-05-14",
      "endDate": "2019-08-12",
      "summary": "Conducted advanced bioinformatic and statistical analyses in support of cancer epidemiology research. Developed several R packages and worked with diverse data systems architects to coordinate development efforts throughout the data life cycle. Applied novel analytic approaches and software pipelines to multiplex immunohistochemistry data.",
      "highlights": [
        "Designed and developed a Shiny dashboard interface with companion R package for analysis of the FCDS Florida Cancer Registry data",
        "Created and led an in-depth course on data processing with R for data analysts in Moffitt's Collaborative Data Services Core",
        "Awarded internal $50,000 grant as Co-PI with Dr. Gerke to develop DV3, a framework for data virtualization, visualization and versioning"
      ]
    },
    {
      "company": "University of South Florida",
      "website": "http://usf.edu/engineering/create-health/",
      "position": "Project Coordinator and Research Associate",
      "startDate": "2014-09-01",
      "endDate": "2018-01-01",
      "summary": "Led diverse team of Ph.D., masters and undergraduate students in development and evaluation of large smart home project for monitoring the daily activities of community-dwelling, independent older adults.",
      "highlights": [
        "Managed 3 Ph.D., 5 Masters, and 4 undergraduate REU students",
        "Lead software developer for remote sensor data collection, processing, storage, administration, and visualization",
        "Developed several R packages and Shiny dashboards and interactive front-ends for inventory management and data processing",
        "Provisioned and administered database and backend servers supporting remote data collection systems running on Raspberry Pis",
        "Designed and implemented notification microservice for near-real-time evaluation and alerting for emergent conditions"
      ]
    },
    {
      "company": "University of South Florida",
      "position": "R Package Developer: MCTestAnalysis",
      "website": "https://gadenbuie.github.io/mctestanalysis/",
      "startDate": "2016-07-01",
      "endDate": "2017-03-01",
      "summary": "Developed an R package for Multiple-Choice Test Analysis for educators who are not comfortable programming. The package includes a web interface for interactive exploration of test results, or a generated report based on best practices for the design and evaluation of multiple-choice tests."
    },
    {
      "company": "University of South Florida",
      "position": "Research Assistant",
      "startDate": "2013-09-01",
      "endDate": "2014-09-01",
      "summary": "Various tasks and responsibilities in support of engineering education at USF."
    },
    {
      "company": "Patel College of Global Sustainability, USF",
      "website": "http://www.usf.edu/pcgs/",
      "position": "Research Assistant",
      "startDate": "2012-06-01",
      "endDate": "2013-09-01",
      "summary": "",
      "highlights": [
        "Research and design of an urban metabolism model for the USF Tampa Campus.",
        "Supervised research of two undergraduate students (Spring 2013).",
        "Assistant to the Director of the Office of Sustainability, USF. Coordinated, analyzed and prepared reports on campus sustainability-related initiatives.",
        "Assist with research objectives of PCGS and in the preparation of reports, lectures and talks by PCGS staff and faculty."
      ]
    }
  ],
  "certifications": [
    {
      "name": "RStudio Certified Tidyverse Instructor",
      "startDate": "2019-09-03",
      "endDate": "",
      "area": "https://education.rstudio.com/trainers/"
    }
  ],
  "education": [
    {
      "institution": "University of South Florida",
      "courses": [
        "Deep Learning",
        "Statistical Design Models",
        "Large-Scale Optimization",
        "Advanced Analytics",
        "Bayesian Data Analysis"
      ],
      "startDate": "2014-12-01",
      "endDate": "2018-12-01",
      "area": "Industrial and Management Systems Engineering",
      "studyType": "Ph.D. Candidate (exited ABD)"
    },
    {
      "institution": "University of South Florida",
      "startDate": "2012-09-01",
      "endDate": "2018-12-01",
      "area": "Industrial & Mgmt. Systems Engineering",
      "studyType": "MSIE (2014), Ph.D. Candidate (exited ABD)"
    },
    {
      "institution": "Lehigh University",
      "startDate": "2002-09-01",
      "endDate": "2007-05-01",
      "area": "B.S. Applied Math, B.A. Spanish, Physics (minor)",
      "honors": [
        "Phi Beta Kappa",
        "High Honors",
        "Dean's List"
      ]
    },
    {
      "institution": "Universidad Autónoma de Madrid and Syracuse University in Madrid",
      "startDate": "2005-09-01",
      "endDate": "2006-08-01",
      "area": "Spanish",
      "studyType": "Study Abroad"
    }
  ],
  "skills": [
    {
      "name": "Advanced",
      "level": "advanced",
      "keywords": [
        "R",
        "Shiny",
        "RMarkdown",
        "JavaScript",
        "HTML",
        "CSS",
        "Git",
        "R Package Development",
        "Database Management",
        "SQL (MySQL, SQLite, Postgres)",
        "Command-line Scripting (Bash)",
        "MS Office (Excel, etc.)"
      ]
    },
    {
      "name": "Intermediate",
      "level": "intermediate",
      "keywords": [
        "Python",
        "PHP",
        "MQTT"
      ]
    },
    {
      "name": "Familiar",
      "level": "beginner",
      "keywords": [
        "Julia",
        "Go"
      ]
    },
    {
      "name": "Operating Systems",
      "level": "intermediate",
      "keywords": [
        "Linux (Debian, Ubuntu, Other)",
        "macOS",
        "Amazon AWS",
        "Google Cloud",
        "Docker",
        "Windows"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "President, INFORMS Student Chapter at USF",
      "startDate": "2014-05-01",
      "endDate": "2015-05-01",
      "summary": "Served as President of the USF student chapter of INFORMS, the leading international association for Operations Research and Analytics professionals.",
      "highlights": [
        "Started a student-led monthly journal club to share and disseminate cutting-edge publications in statistics, machine learning, and operations research.",
        "Initiated a travel grant supported by internal fundraising to partially finance the attendance of chapter members at the INFORMS Annual Meeting.",
        "Organized and led a college-wide code and data bootcamp for undergraduate and graduate students, featuring hands-on learning of data science and programming principles.",
        "Led planning team for INFORMS@USF Code & Data Bootcamp, built comprehensive webpage, organized sessions and source code, and presented multiple sessions on programming and data science with R."
      ]
    },
    {
      "organization": "Peace Corps",
      "address": "Gualaceo, Ecuador",
      "position": "Youth Development Specialist",
      "startDate": "2008-06-16",
      "endDate": "2009-08-20",
      "summary": "Served in the Peace Corps in Gualaceo, Ecuador, working in conjuction with local organizations to provide leadership training to children and youth among a number of other highlights listed below. ",
      "highlights": [
        "Created and implemented life-skills training program, educating 70 at-risk middle school students.",
        "Led Peace Corps Ecuador’s Anti-Trafficking In Persons committee and created a collaborative, contest-based fundraiser for a shelter for trafficked women in Guayaquil, Ecuador.",
        "Individually tutored seven middle- and high-school students and two college math students in math topics such as Trigonometry, Algebra and Calculus.",
        "Designed interactive graphics and edited a six-month, biweekly column published in the leading local newspaper, appealing to both children and parents, highlight topics including hygiene, public health and children’s rights.",
        "Organized and delivered an educational course for parents on drug and alcohol abuse prevention in high-risk community."
      ]
    }
  ],
  "awards": [
    {
      "title": "Runner Up, Shiny App Contest",
      "date": "2019-04-01",
      "awarder": "RStudio",
      "summary": "Selected as one of 10 developers from 136 submissions in recognition of a web app and dashboard built using Shiny. The dashboard monitors social media conversations around a conference or event, and received hundreds of simultaneous visitors per day during RStudio's annual conference in January 2019."
    }
  ],
  "publications": [
    {
      "name": "HomeSense: Design of an ambient home health and wellness monitoring platform for older adults",
      "publisher": "Health and Technology",
      "releaseDate": "2020-07-03",
      "summary": "VandeWeerd C, Yalcin A, Aden-Buie G, Wang Y, Roberts M, Mahser N, Fnu C, Fabiano D",
      "url": "https://link.springer.com/article/10.1007/s12553-019-00404-6"
    },
    {
      "name": "shinyDAG: A web application for building, analyzing, and visualizing directed acyclic graphs (DAGs)",
      "publisher": "Epidemiology (In Review)",
      "releaseDate": "2020",
      "summary": "Creed J, Aden-Buie G, Gerke TA"
    },
    {
      "name": "Effects of tobacco smoking on the tumor immune microenvironment in head and neck squamous cell carcinoma",
      "publisher": "Clinical Cancer Research",
      "releaseDate": "2019",
      "summary": "Janis, V, Slebos, RJ, Martin-Gomez, L, Wang, X, Teer, JK, Tan, AC, Gerke, TA, Aden-Buie, G, Van Veen, T, Masannat, J and Chaudhary, R"
    },
    {
      "name": "epiTAD: a web application for visualizing chromosome conformation capture data in the context of genetic epidemiology",
      "publisher": "Bioinformatics",
      "releaseDate": "2019-05-01",
      "summary": "Creed J, Aden-Buie G, Monteiro A, Gerke TA"
    },
    {
      "name": "Prostate-specific antigen (PSA) levels in men 60 to 70 years of age predict aggressive prostate cancer in the PLCO cancer screening trial: Implications for risk-stratified screening",
      "publisher": "European Association of Urology Congress: Mar 15–19; Barcelona, Spain.",
      "releaseDate": "2019",
      "summary": "Berger A, Aden-Buie G, Kibel AS, Mucci LA, Penney K, Wilson K, Gerke TA, Preston M"
    },
    {
      "name": "Identifying genetic interactions that drive aggressive prostate cancer using an ensemble of penalized Cox regression models",
      "publisher": "AACR Convergence: Artificial Intelligence, Big Data, and Prediction in Cancer: Oct 14-17; Newport, RI",
      "releaseDate": "2018-10-14",
      "summary": "Laajala TD, Aden-Buie G, Gerke T, Creed J, Berglund A, Stopsack K, Cramer SD, Tyekucheva S, Aittokallio T, Costello JC"
    },
    {
      "name": "Accessible pipeline for translational research using TCGA: Tristetraprolin as an example relating gene mechanism to a disease specific outcomes",
      "publisher": "TCGA Legacy: Multi-Omic Studies in Cancer, Sep 27-29; Washington, DC",
      "releaseDate": "2018",
      "summary": "Berglund A, Putney R, Creed J, Aden-Buie G, Gerke T, Rounbehler R"
    },
    {
      "name": "Comparison of Final Examination Formats in a Numerical Methods Course",
      "publisher": "International Journal of Engineering Education",
      "releaseDate": "2015",
      "summary": "Aden-Buie G, Kaw A, Yalcin A"
    },
    {
      "name": "Rough Set Theory Based Prognostic Classification Models for Hospice Referral",
      "publisher": "BMC Medical Informatics and Decision Making",
      "releaseDate": "2015",
      "summary": "Gil-Herrera E and Aden-Buie G, Yalcin A, Tsalatsanis A, Barnes LE, Djulbegovic B"
    },
    {
      "name": "Introduction to Engineering Design: Piloting design projects for the first year engineering experience",
      "publisher": "Sixth Annual First Year Engineering Experience Conference",
      "releaseDate": "2014",
      "summary": "Gaines J, Joseph B, Aden-Buie G"
    },
    {
      "name": "Are multiple-choice questions suitable for a final examination in a STEM course?",
      "publisher": "American Society for Engineering Education",
      "releaseDate": "2014",
      "summary": "Aden-Buie G, Kaw A, Yalcin A, Pendyala R"
    }
  ],
  "presentations": [
    {
      "name": "Build Your Own Universe",
      "date": "2020-08-28",
      "event": "R/Medicine 2020",
      "website": "https://www.garrickadenbuie.com/talk/build-your-own-universe/"
    },
    {
      "name": "Your Slides are So Extra!",
      "date": "2020-07-08",
      "event": "useR!2020",
      "website": "https://www.garrickadenbuie.com/talk/extra-special-xaringan/"
    },
    {
      "name": "10,000 Reasons to Love Functions",
      "date": "2020-05-15",
      "event": "Bio-Data Club at Moffitt Cancer Center",
      "website": "https://www.garrickadenbuie.com/talk/ten-thousand-functions/"
    },
    {
      "name": "Reproducible Data Workflows with Drake",
      "date": "2019-07-19",
      "event": "Bio-Data Club at Moffitt Cancer Center",
      "website": "https://gadenbuie.github.io/drake-intro/"
    },
    {
      "name": "A Gentle Guide to the Grammar of Graphics with ggplot2",
      "date": "2018-11-06",
      "event": "Workshop on Data Analysis Using R (ASA at USF)",
      "website": "https://www.garrickadenbuie.com/talk/gentle-ggplot2"
    },
    {
      "name": "The Passive Smart Home: Unobtrusive At-Home Behavior Monitoring",
      "date": "2018-10-29",
      "event": "Utilizing Technology for Data Collection and Intervention, Moffitt Cancer Center",
      "website": "http://www.garrickadenbuie.com/slides/moffitt-passive-smart-home/",
      "summary": "Aden-Buie G"
    },
    {
      "name": "Unsupervised behavior change detection using passive sensor systems in the homes of older adults",
      "date": "2018-05-07",
      "event": "11th World Conference of Gerontechnology",
      "website": "https://www.garrickadenbuie.com/talk/isg-2018/",
      "summary": "Aden-Buie G, Yalcin A, VandeWeerd C"
    },
    {
      "name": "A Gentle Guide to the Grammar of Graphics with ggplot2",
      "date": "2018-01-23",
      "event": "Tampa R Users Meetup",
      "website": "https://gadenbuie.github.io/trug-ggplot2",
      "summary": "An introduction to data visualization with the R package ggplot2"
    },
    {
      "name": "Occupant Activity Profiles from Smart Home Sensor Event Streams",
      "date": "2017-10-25",
      "event": "INFORMS Annual Meeting",
      "website": "https://www.garrickadenbuie.com/talk/informs-2017/",
      "summary": "Aden-Buie G, Yalcin A, VandeWeerd C"
    },
    {
      "name": "Getting StaRted in R",
      "date": "2016-03-25",
      "event": "INFORMS@USF Code & Data Boot Camp",
      "website": "https://github.com/gadenbuie/usf-boot-camp-R"
    },
    {
      "name": "Ambient Intelligence Applications in Healthcare",
      "date": "2015-02-06",
      "event": "ISERC at IIE Annual Conference & Expo",
      "website": "https://www.garrickadenbuie.com/talk/iie-iserc-2015/",
      "summary": "Aden-Buie G, Yalcin A, VandeWeerd C, Agu N, Hammett J, Yetisener E, Radwan C"
    },
    {
      "name": "Reporting Reproducible Research with R and Markdown",
      "date": "2014-04-11",
      "event": "INFORMS@USF Code & Data Boot Camp",
      "website": "https://github.com/gadenbuie/usf-boot-camp-R"
    },
    {
      "name": "Boosted Tree Ensembles for Predicting Postsurgical ICU Mortality",
      "date": "2013-10-07",
      "event": "INFORMS Annual Meeting",
      "website": "https://www.garrickadenbuie.com/talk/informs-2013/",
      "summary": "Aden-Buie G, Chen Y, Romero G, Kayal R, Yang H"
    }
  ],
  "interests": [
    {
      "keywords": [
        "Data Visualization",
        "Acoustic Instruments",
        "Music",
        "Soccer",
        "Books",
        "Blogging"
      ]
    }
  ],
  "projects": [
    {
      "name": "Scientific Software",
      "highlights": [
        "moffittCDS - An internal R package for the Collaborative Data Services Core at Moffitt for managing projects, creating reports, and connecting to various databases",
        "fcds — [gerkelab.github.io/fcds](https://gerkelab.github.io/fcds) <br>An R package and Shiny web application for the analysis of Florida Cancer Regististry data from the [Florida Cancer Data System](https://fcds.med.miami.edu/inc/welcome.shtml)",
        "ShinyDAG — [gerkelab.com/project/shinydag](https://gerkelab.com/project/shinydag) <br>A web application for building, analyzing, and visualizing directed acyclic graphs (DAGs)",
        "epiTAD — [gerkelab.com/project/epiTAD](https://gerkelab.com/project/epiTAD) <br>A web application for visualizing chromosome conformation capture data in the context of genetic epidemiology"
      ]
    },
    {
      "name": "Open Source Software",
      "summary": "I enjoy contributing to open source software projects and whenever possible I contribute to the R packages that I use. I also have released the following software packages for R on GitHub:",
      "highlights": [
        "regexplain: [garrickadenbuie.com/project/regexplain/](https://www.garrickadenbuie.com/project/regexplain/)",
        "xaringanthemer: [pkg.garrickadenbuie.com/xaringanthemer](https://pkg.garrickadenbuie.com/xaringanthemer)",
        "xaringanExtra: [pkg.garrickadenbuie.com/xaringanExtra](https://pkg.garrickadenbuie.com/xaringanExtra)",
        "js4shiny: [pkg.js4shiny.com/](http://pkg.js4shiny.com/)",
        "ggpomological: [garrickadenbuie.com/project/ggpomological](https://www.garrickadenbuie.com/project/ggpomological)",
        "countdown: [pkg.garrickadenbuie.com/countdown](https://pkg.garrickadenbuie.com/countdown)",
        "tidyexplain: [garrickadenbuie.com/project/tidyexplain/](https://www.garrickadenbuie.com/project/tidyexplain)",
        "rsthemes: [garrickadenbuie.com/project/rsthemes](https://www.garrickadenbuie.com/project/rsthemes)",
        "shrtcts: [pkg.garrickadenbuie.com/shrtcts](https://pkg.garrickadenbuie.com/shrtcts/)",
        "metathis: [pkg.garrickadenbuie.com/metathis/](https://pkg.garrickadenbuie.com/metathis/)",
        "ggweekly: [github.com/gadenbuie/ggweekly](https://github.com/gadenbuie/ggweekly)",
        "cleanrmd: [pkg.garrickadenbuie.com/cleanrmd](https://pkg.garrickadenbuie.com/cleanrmd)",
        "tweetrmd: [github.com/gadenbuie/tweetrmd](https://github.com/gadenbuie/tweetrmd)",
        "MCTestAnalysis: [garrickadenbuie.com/project/mc-test-analysis/](https://www.garrickadenbuie.com/project/mc-test-analysis/)"
      ]
    }
  ],
  "references": [],
  "languages": [
    {
      "language": "English",
      "level": "Native"
    },
    {
      "language": "Spanish",
      "level": "Superior ACTFL/ETS"
    }
  ]
}
